app/views/posts/index.html.erb

SELECT "users"."id" FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 1]]
---
    <li>
      <h3><%= link_to image_tag(User.find_by(id: post.user_id).photo_url, {height:30}) +  User.find_by(id: post.user_id).name, url_for(user_path(post.user_id))  %></h3>