app/views/posts/index.html.haml

    %h4= post.title
    %h5= User.find_by(id: post.user_id).name
---
SELECT "users"."id" FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1  [["user_id", 2]]