app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" ASC LIMIT 1  [["user_id", 4]]
---
  def index
    if current_user
      friend_array_one = current_user.friends
      friend_array_two = current_user.inverse_friends
      friend_array = friend_array_one.pluck(:id) + friend_array_two.pluck(:id)
      friend_array << current_user.id
      posts = Post.where(user_id: friend_array)