app/controllers/sessions_controller.rb

  def create
    if User.find_by_email(params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'n@n.com' LIMIT 1